# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름:허성일
학번:201603727
학과:컴퓨터전자시스템공학부
제출일:12/04
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 18번 20점, 총200점**

In [ ]:
%load_ext sql

In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading https://files.pythonhosted.org/packages/1a/ea/dd9c81e2d85efd03cfbf808736dd055bd9ea1a78aea9968888b1055c3263/PyMySQL-0.10.1-py2.py3-none-any.whl (47kB)
     |████████████████████████████████| 51kB 3.7MB/s
Installing collected packages: pymysql
Successfully installed pymysql-0.10.1

### Use your host, id, password, and database

In [ ]:
import getpass
user = 'admin'
password = getpass.getpass()
host='database-1.cayydxoic97b.us-east-1.rds.amazonaws.com'
database = 'companydb'
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: admin@companydb'

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab on AWS RDS"

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-13번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [ ]:
%%sql         10
-- YOUR CODE HERE

select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e, PROJECT p, WORKS_ON w
where p.Pname='ProductX' and p.Pnumber=w.Pno and w.Hours >= 10 and w.Essn=e.Ssn and e.Dno=5;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]



---



---


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [ ]:
%%sql         10
-- YOUR CODE HERE

select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e
where EXISTS(
    select *
    from DEPENDENT d
    where e.Ssn=d.Essn and d.Sex=e.Sex
);

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [ ]:
%%sql         10
-- YOUR CODE HERE

select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e
where EXISTS(
    select *
    from EMPLOYEE f
    where f.Fname='Franklin' and f.Lname='Wong' and f.Ssn=e.Superssn
    );

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [ ]:
%%sql         10
-- YOUR CODE HERE

select p.Pname as 'Project name', sum(w.Hours) as 'Total hours'
from PROJECT p, WORKS_ON w
where p.Pnumber=w.Pno
group by w.Pno;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
6 rows affected.

[('Computerization', Decimal('55.0')),
 ('Newbenefits', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductY', Decimal('37.5')),
 ('ProductZ', Decimal('50.0')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [ ]:
%%sql         10
-- YOUR CODE HERE
select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e
where not exists(
    select *
    from DEPARTMENT d, PROJECT p
    where d.Dname='Administration' and d.Dnumber=p.Dnum and not exists(
        select *
        from WORKS_ON w
        where p.Pnumber=w.Pno and w.Essn=e.Ssn)
    );

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
2 rows affected.

[('Ahmad V. Jabbar',), ('Alicia J. Zelaya',)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [ ]:
%%sql         10
-- YOUR CODE HERE

select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e
where not exists(
    select *
    from PROJECT p, WORKS_ON w
    where p.Plocation='Houston' and p.Pnumber=w.Pno and w.Essn=e.Ssn);

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [ ]:
%%sql         10
-- YOUR CODE HERE
select d.Dname as 'Department name', TRUNCATE(AVG(e.Salary),2) as 'Average salary'
from EMPLOYEE e, DEPARTMENT d
where d.Dnumber=e.Dno
group by e.Dno;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
3 rows affected.

[('Administration', Decimal('31000.00')),
 ('Headquarters', Decimal('55000.00')),
 ('Research', Decimal('33250.00'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [ ]:
%%sql         10
-- YOUR CODE HERE
select TRUNCATE(AVG(e.Salary),2) as 'Average salary'
from EMPLOYEE e
where e.Sex='F';

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[(Decimal('31000.00'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [ ]:
%%sql         10
-- YOUR CODE HERE
select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name', e.Address as Address
from EMPLOYEE e
where exists(
    select *
    from PROJECT p, WORKS_ON w
    where p.Plocation='Houston' and p.Pnumber=w.Pno and w.Essn=e.Ssn)
and not exists(
    select *
    from DEPT_LOCATIONS d
    where d.Dlocation='Houston' and e.Dno=d.Dnumber
);

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[('Jennifer S. Wallace', '291-Berry-Bellaire-TX')]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [ ]:
%%sql         10
-- YOUR CODE HERE
select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e
where EXISTS(
    select *
    from DEPARTMENT d
    where e.Ssn=d.Mgrssn and NOT EXISTS(
        select *
        from DEPENDENT dd
        where dd.Essn=e.Ssn
        )
);

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[('James E. Borg',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [ ]:
%%sql         10
-- YOUR CODE HERE
select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from (EMPLOYEE m join EMPLOYEE e on e.Dno=m.Dno)
where m.salary = (select max(m.salary) from EMPLOYEE m);

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[('James E. Borg',)]

#### 12-1. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [ ]:
%%sql         10
-- YOUR CODE HERE
select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e
where EXISTS(
    select *
    from EMPLOYEE s
    where e.Superssn=s.Ssn and EXISTS(
        select *
        from EMPLOYEE j
        where j.Fname='James' and j.Lname='Borg' and j.Ssn=s.Superssn
    )
);

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 12-2. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [ ]:
%%sql
-- YOUR CODE HERE
select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from ((EMPLOYEE e left outer join EMPLOYEE s on e.Superssn=s.Ssn) left outer join EMPLOYEE j on s.Superssn=j.Ssn)
where j.Fname='James' and j.Lname='Borg';

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [ ]:
%%sql         10
-- YOUR CODE HERE
select concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name'
from EMPLOYEE e
where e.salary >= (select min(salary) from EMPLOYEE)+10000;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('Franklin T. Wong',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Jennifer S. Wallace',)]

### 14-17번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 14. A view that has the department name, manager name, and manager salary for every department

In [ ]:
%%sql         10
-- YOUR CODE HERE
CREATE VIEW DEPT_VIEW
AS
SELECT d.Dname as 'department name', concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'manager name', e.Salary as 'manager salary'
FROM DEPARTMENT d, EMPLOYEE e
WHERE d.Mgrssn=e.Ssn;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.

[]

In [ ]:
%sql select * from DEPT_VIEW;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
3 rows affected.

[('Headquarters', 'James E. Borg', Decimal('55000.00')),
 ('Administration', 'Jennifer S. Wallace', Decimal('43000.00')),
 ('Research', 'Franklin T. Wong', Decimal('40000.00'))]

#### 15. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [ ]:
%%sql         10
-- YOUR CODE HERE
CREATE VIEW RESEARCH_DEPT_VIEW
AS
SELECT concat(e.Fname,' ',e.Minit,'. ', e.Lname) as 'Employee name', concat(s.Fname,' ',s.Minit,'. ', s.Lname) as 'Supervisor name'  ,e.Salary
FROM EMPLOYEE e, DEPARTMENT d, EMPLOYEE s
WHERE d.Dnumber=e.Dno and d.Dname='Research' and s.Ssn=e.Superssn;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.

[]

In [ ]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('John B. Smith', 'Franklin T. Wong', Decimal('30000.00')),
 ('Franklin T. Wong', 'James E. Borg', Decimal('40000.00')),
 ('Joyce A. English', 'Franklin T. Wong', Decimal('25000.00')),
 ('Ramesh K. Narayan', 'Franklin T. Wong', Decimal('38000.00'))]

#### 16. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [ ]:
%%sql         10
-- YOUR CODE HERE
CREATE VIEW PROJECT_VIEW
AS
SELECT p.Pname as 'project name', d.Dname as 'department name', COUNT(*) as 'number of employees', SUM(w.Hours) as 'total hours'
FROM PROJECT p, DEPARTMENT d, WORKS_ON w
WHERE p.Pnumber=w.Pno and d.Dnumber=p.Dnum
group by p.Pnumber;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
6 rows affected.

[('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0'))]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [ ]:
%%sql         10
-- YOUR CODE HERE
CREATE VIEW PROJECT_VIEW_GT2
AS
select p.Pname as 'project name', d.Dname as 'department name', COUNT(*) as 'number of employees', SUM(w.Hours) as 'total hours'
from PROJECT p, DEPARTMENT d, WORKS_ON w
where d.Dnumber=p.Dnum and p.Pnumber=w.Pno
group by p.Pnumber
having count(*) >= 2;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
6 rows affected.

[('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0'))]

#### 18. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 18번 문제 Update 한 후에 1-17번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-17번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [ ]:
%%sql         20
-- YOUR CODE HERE for "create table ..."
CREATE TABLE salary_audit
(
        ssn CHAR(9),
        before_salary DECIMAL(10, 2), 
        after_salary DECIMAL(10, 2),
        u_datetime DATE,
        FOREIGN KEY (ssn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;

--

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.

[]

In [ ]:
%%sql
-- YOUR CODE HERE for "create trigger ..."
CREATE TRIGGER salary_audit_trig
after update on EMPLOYEE
for each row
begin
  if new.salary <> old.salary 
  then insert into salary_audit values (new.ssn, old.salary, new.salary, now());
  end if;
end;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.

[]

In [ ]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://admin:***@database-1.cayydxoic97b.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('123456789', Decimal('30000.00'), Decimal('60000.00'), datetime.date(2020, 12, 4)),
 ('333445555', Decimal('40000.00'), Decimal('80000.00'), datetime.date(2020, 12, 4)),
 ('453453453', Decimal('25000.00'), Decimal('50000.00'), datetime.date(2020, 12, 4)),
 ('666884444', Decimal('38000.00'), Decimal('76000.00'), datetime.date(2020, 12, 4))]